Repository: Inova-MPRJ/standard
Catalog: docs/locale/*/LC_MESSAGES/getting_started/releases_and_records.po
Languages: fr

source: Releases and Records
fr: Instances et archives

source: There are two kinds of OCDS document:
fr: Il existe deux types de documents OCDS :

source: **Releases** provide updates on each event in a contracting process, ideally in real-time. They can be used to notify users of new tenders, awards, contracts and other updates. One contracting process can have many releases.
fr: Les **instances** (releases) fournissent des mises à jour sur chaque évènement dans le processus de passation de marché, idéalement en temps réel. Elles peuvent être utilisées pour notifier les utilisateurs de nouveaux appels d'offres, attributions, contrats et tout autre mise à jour. Un processus de passation de marché peut donner lieu à de nombreuses instances.

source: **Records** aggregate all the releases available for a contracting process at a given time. There ought to be only be one record per contracting process.
fr: Les **archives** (records) regroupent toutes les versions disponibles pour un processus de passation de marché à un moment donné. Il ne devrait y avoir qu'une seule archive par passation de marché.

source: Releases
fr: Instances

source: Releases are immutable – presenting information about a particular event in the lifetime of a contracting process. The release `id` needs to be changed whenever the value of another field in the release is changed.
fr: Les instances doivent être immuables : elles présentent des informations à propos d'un évènement dans le cycle de vie d'un processus de passation de marché. L' `id` de l'instance doit être modifié chaque fois que la valeur d'un autre champ est modifiée.

source: Each release needs to contain an `ocid`, a unique release `id` and a release `tag`, and ought to contain as much information as can be provided for users to understand the event taking place.
fr: Chaque instance doit comprendre un identifiant `ocid`, un identifiant d'instance `id` , un `tag` d'instance et autant d'informations que possible pour que les utilisateurs comprennent l'évènement en cours.

source: For example:
fr: Par exemple :

source: A 'planning' release can provide information in the `planning` section about budgets and procurement intention, and the `tender` section about the proposed details for a future tender;
fr: Une instance "planning" (planification) peut comprendre des informations de la section `planning` à propos des budgets et des intentions de commande publique et de la section `tender`à propos des détails proposés pour un futur appel d'offre ;

source: A 'tender' release can provide information in the `tender` section about how to bid for the work, and can repeat `planning` section information on the budget or project the tender is associated with;
fr: Une instance "tender" (appel d'offres) peut contenir des informations de la section `tender` expliquant comment être candidat et peut répéter des informations de la section `planning`sur le budget ou le projet auquel l'appel d'offres est associé ;

source: A 'tenderUpdate' release can provide an updated `tender` section with links to documents that answer questions asked during the enquiry period;
fr: Une instance 'tenderUpdate' (mise à jour de l'appel d'offres) sur la mise à jour de l'appel d'offres peut fournir une version mise à jour de la section `tender` avec des liens vers les documents qui répondent aux questions posées pendant la période d'examen ;

source: An 'award' release can provide details of the supplier awarded the contract in the `award` section, and can provide repeated information about the how procurement took place in the `tender` section;
fr: Une instance "award" (attribution) peut contenir des détails sur le fournisseur auquel le contrat a été attribué dans la section `award` , et peut répéter des informations sur la manière dont les appels d'offres ont eu lieu dans la section `tender` ;

source: A 'contract' release can provide the details of the signed contract in a `contract` section, matched with a related `award` section;
fr: Une instance "contract" (contrat) peut fournir des détails sur le contrat signé de la section `contract` en lien avec la section `award` sur l'attribution qui correspond ;

source: An 'implementationUpdate' release can repeat details of the `contract`, and provide information on milestones achieved and payments to the supplier, or can update the contract `implementation` section with links to newly published documents.
fr: Une instance "implementationUpdate" (mise à jour de la phase d'exécution) peut répéter des détails sur le contrat `contract`et fournir des informations sur les étapes achevées et les paiements au fournisseur et peut mettre à jour la section `implementation`avec des liens aux documents nouvellement publiés.

source: You can think of **releases** as entries into a ledger: each new entry adds information. Each entry can also repeat the previous information that remains true.
fr: Vous pouvez considérer les **instances** comme des entrées dans un grand livre : chacune ajoute de nouvelles informations. Chacune peut aussi répéter des informations qui restent vraies.

source: Examples
fr: Exemples

source: Best practices
fr: Meilleures pratiques

source: In some cases, releases will all come from the same backend system. In others, they will be generated by different systems. By ensuring all releases about a contracting process share an `ocid`, they can be tied together into a record.
fr: Dans certains cas, les instances viendront toutes du même système de gestion. Dans d'autres, elles seront générées à partir de systèmes différents. En s'assurant que toutes les instances à propos d'un processus de passation de marché partagent un identifiant `ocid`, elles peuvent être liées à une archive.

source: In a complete OCDS implementation, each release would be published at its own persistent URL, and kept online permanently.
fr: Dans une implémentation complète du standard OCDS, chaque instance est publiée avec sa propre URL permanente et diffusée en ligne de manière permanente.

source: In some cases, a publisher might only have the data infrastructure to publish and iteratively update one release for each contracting process. If so, the release `id` and release `date` need to be modified with each update. A suggested pattern for generating a unique release `id` is to append an incrementing number to the end of the `ocid`: for example, if the `ocid` is "ocds-a2ef3d01-1594121", then each sequential release `id` can be:
fr: Dans certains cas, un éditeur peut uniquement disposer de l'infrastructure de données à publier et mettre à jour de manière itérative une version pour chaque processus de passation de marché. Dans ce cas, les versions `id` et `date` de l'instance doivent être modifiées à chaque mise à jour. Un modèle suggéré pour générer un `id` unique de l'instance consiste à ajouter un numéro incrémental à la fin de `ocid` : par exemple, si le `ocid` est "ocds-a2ef3d01-1594121 ", alors chaque `id` de version séquentielle peut devenir :

source: Records
fr: Archives

source: An OCDS **record** provides a snapshot of the contracting process at a given point in time, bringing together all the information from the releases to date into one place. It is updated as new information becomes available.
fr: Une **archive** propose un instantané du processus de passation de marché à un moment donné, rassemblant en un seul endroit toutes les informations issues des instances publiées à date. Elle est mise à jour dès que de nouvelles informations deviennent disponibles.

source: At a minimum, a record ought to exist for each contracting process, to provide a list of all the releases that relate to that contracting process.
fr: Au minimum, chaque processus de passation de marché doit avoir une archive pour fournir une liste de toutes les instances qui concernent ce marché.

source: However, to allow users to get a snapshot view the contracting process without individually looking up each release, a record ought to also contain:
fr: Cependant, pour permettre aux usagers d'avoir une vue instantanée sans avoir à consulter chaque instance, une archive doit aussi contenir :

source: a compiled release, which expresses the current state of the contracting process, by showing only the most recent field values
fr: Une instance compilée donne un aperçu de l'état actuel d'un processus de passation de marché, et le contenu doit suivre le schéma d'instance.

source: a versioned release, which expresses all historical states of the contracting process, by showing all the field values over time
fr: Une instance compilée donne un aperçu de l'état actuel d'un processus de passation de marché, et le contenu doit suivre le schéma d'instance.

source: The [merging documentation](../schema/merging) set out how to combine multiple releases to create a single record for each contracting process.
fr: Les [stratégies de fusion OCDS](../schema/merging) définissent la façon de combiner plusieurs instances pour créer une seule archive pour chaque processus de passation de marché.
